import MapApp from '../assets/MapApp';

const Japan = () => {

  const gameid = 'japan';

  const gameTitle = '日本の47都道府県全部言えるかな？';

  const allDistricts = [
    { id: '北海道', names: ['北海道', 'ほっかいどう'] },
    { id: '青森県', names: ['青森県', 'あおもりけん', '青森', 'あおもり'] },
    { id: '岩手県', names: ['岩手県', 'いわてけん', '岩手', 'いわて'] },
    { id: '宮城県', names: ['宮城県', 'みやぎけん', '宮城', 'みやぎ'] },
    { id: '秋田県', names: ['秋田県', 'あきたけん', '秋田', 'あきた'] },
    { id: '山形県', names: ['山形県', 'やまがたけん', '山形', 'やまがた'] },
    { id: '福島県', names: ['福島県', 'ふくしまけん', '福島', 'ふくしま'] },
    { id: '茨城県', names: ['茨城県', 'いばらきけん', '茨城', 'いばらき'] },
    { id: '栃木県', names: ['栃木県', 'とちぎけん', '栃木', 'とちぎ'] },
    { id: '群馬県', names: ['群馬県', 'ぐんまけん', '群馬', 'ぐんま'] },
    { id: '埼玉県', names: ['埼玉県', 'さいたまけん', '埼玉', 'さいたま'] },
    { id: '千葉県', names: ['千葉県', 'ちばけん', '千葉', 'ちば'] },
    { id: '東京都', names: ['東京都', 'とうきょうと', '東京', 'とうきょう'] },
    { id: '神奈川県', names: ['神奈川県', 'かながわけん', '神奈川', 'かながわ'] },
    { id: '新潟県', names: ['新潟県', 'にいがたけん', '新潟', 'にいがた'] },
    { id: '富山県', names: ['富山県', 'とやまけん', '富山', 'とやま'] },
    { id: '石川県', names: ['石川県', 'いしかわけん', '石川', 'いしかわ'] },
    { id: '福井県', names: ['福井県', 'ふくいけん', '福井', 'ふくい'] },
    { id: '山梨県', names: ['山梨県', 'やまなしけん', '山梨', 'やまなし'] },
    { id: '長野県', names: ['長野県', 'ながのけん', '長野', 'ながの'] },
    { id: '岐阜県', names: ['岐阜県', 'ぎふけん', '岐阜', 'ぎふ'] },
    { id: '静岡県', names: ['静岡県', 'しずおかけん', '静岡', 'しずおか'] },
    { id: '愛知県', names: ['愛知県', 'あいちけん', '愛知', 'あいち'] },
    { id: '三重県', names: ['三重県', 'みえけん', '三重', 'みえ'] },
    { id: '滋賀県', names: ['滋賀県', 'しがけん', '滋賀', 'しが'] },
    { id: '京都府', names: ['京都府', 'きょうとふ', '京都', 'きょうと'] },
    { id: '大阪府', names: ['大阪府', 'おおさかふ', '大阪', 'おおさか'] },
    { id: '兵庫県', names: ['兵庫県', 'ひょうごけん', '兵庫', 'ひょうご'] },
    { id: '奈良県', names: ['奈良県', 'ならけん', '奈良', 'なら'] },
    { id: '和歌山県', names: ['和歌山県', 'わかやまけん', '和歌山', 'わかやま'] },
    { id: '鳥取県', names: ['鳥取県', 'とっとりけん', '鳥取', 'とっとり'] },
    { id: '島根県', names: ['島根県', 'しまねけん', '島根', 'しまね'] },
    { id: '岡山県', names: ['岡山県', 'おかやまけん', '岡山', 'おかやま'] },
    { id: '広島県', names: ['広島県', 'ひろしまけん', '広島', 'ひろしま'] },
    { id: '山口県', names: ['山口県', 'やまぐちけん', '山口', 'やまぐち'] },
    { id: '徳島県', names: ['徳島県', 'とくしまけん', '徳島', 'とくしま'] },
    { id: '香川県', names: ['香川県', 'かがわけん', '香川', 'かがわ'] },
    { id: '愛媛県', names: ['愛媛県', 'えひめけん', '愛媛', 'えひめ'] },
    { id: '高知県', names: ['高知県', 'こうちけん', '高知', 'こうち'] },
    { id: '福岡県', names: ['福岡県', 'ふくおかけん', '福岡', 'ふくおか'] },
    { id: '佐賀県', names: ['佐賀県', 'さがけん', '佐賀', 'さが'] },
    { id: '長崎県', names: ['長崎県', 'ながさきけん', '長崎', 'ながさき'] },
    { id: '熊本県', names: ['熊本県', 'くまもとけん', '熊本', 'くまもと'] },
    { id: '大分県', names: ['大分県', 'おおいたけん', '大分', 'おおいた'] },
    { id: '宮崎県', names: ['宮崎県', 'みやざきけん', '宮崎', 'みやざき'] },
    { id: '鹿児島県', names: ['鹿児島県', 'かごしまけん', '鹿児島', 'かごしま'] },
    { id: '沖縄県', names: ['沖縄県', 'おきなわけん', '沖縄', 'おきなわ'] }
  ];

  const isWide = true; {/* ワイドならtrue、正方形ならfalse */ }

  const svgContent = (
    <svg
      width="100%"
      viewBox={isWide ? "0 0 1280 720" : "0 0 720 720"}
      style={{ display: 'block', width: '100%', height: 'auto' }}
    >
      {/* ここから下を貼り替える defはいらない*/}
      <rect
        x="0"
        y="0"
        width="1280"
        height="720"
        fill="#CAEEFB"
        id="rect3" />
      <path
        d="M0 0 32 99"
        stroke="#000000"
        stroke-width="2"
        stroke-miterlimit="8"
        fill="none"
        fill-rule="evenodd"
        transform="matrix(-1 0 0 1 828.505 629)"
        id="path98" />
      <path
        d="M845 614 922.267 614"
        stroke="#000000"
        stroke-width="2"
        stroke-miterlimit="8"
        fill="none"
        fill-rule="evenodd"
        id="path99" />
      <g id="group">
        <g
          id="g100">
          <path
            d="M789 6 783 13.0163 777 10.0093 776 28.5525 784.5 46.5944 778 73.1562 776 89.6947 766 96.711 767.5 121.268 760.5 130.79 733.5 120.767 729 124.275 732.5 137.807 726 146.828 719.5 146.828 716.5 152.842 709.5 153.844 708 174.392 720.5 189.928 713.5 205.965 721.5 221 733.5 212.981 741.5 199.951 758 203.96 762.5 194.939 750.5 187.923 746 180.907 731 177.399 730.5 165.371 742.5 159.858 753 172.888 768 166.373 778.5 157.352 787 160.86 793.5 168.378 800 167.375 814.5 182.41 821.5 180.406 838 193.937 844.5 180.907 839.5 171.886 868.5 139.811 893.5 142.818 895 135.301 903.5 139.31 912.5 131.793 924.5 131.291 924.5 124.776 937 118.762 925 117.259 919 120.767 914 115.254 915 108.238 905 95.2074 917 77.1655 916 64.6364 893.5 88.6923 878.5 89.6947 875.5 80.1725 852.5 74.6597 837.5 66.1398 789 6Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path3" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(802.85 122)"
            id="text49">北海道</text>
        </g>
        <g
          id="g101">
          <path
            d="M732.153 227.372 726.613 223.401 727.117 243.752 713.518 249.708 711 259.635 715.029 271.547 729.635 267.08 733.664 270.058 747.263 265.095 752.299 267.577 749.781 275.518 755.321 278 766.401 271.051 774.964 271.547 780 265.095 774.964 259.139 774.964 259.139 767.912 239.781 767.912 225.883 772.445 214.964 762.876 217.942 750.285 210 745.752 222.409 747.263 231.839 753.81 230.847 758.343 225.883 761.365 235.314 757.839 243.255 750.788 236.803 746.759 245.241 743.234 241.27 742.226 229.854 737.19 225.387 732.153 227.372Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path4" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(734 255)"
            id="text50">青森県</text>
        </g>
        <g
          id="g102">
          <path
            d="M749.25 275.25 748.25 290.75 743 296.5 745.75 302.75 740 321 744.25 323.25 742.5 329.75 747.5 339 758 341.5 761.5 348 769.75 346.75 773 335.75 780.5 339 791.75 322.75 793 304 790.25 286.75 785.5 281.75 786.25 271 778.75 264 774.25 270.75 765.5 270.5 754.5 277.75 749.25 275.25Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path6" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(755.1 310)"
            id="text51">岩手県</text>
        </g>
        <g
          id="g103">
          <path
            d="M716.243 270.876 712.932 283.623 703 286.977 705.649 295.027 715.581 294.356 718.23 311.799 711.608 322.533 712.27 331.925 720.216 332.595 726.176 337.962 726.176 337.962 737.432 344 747.365 337.962 743.392 329.241 744.054 323.203 740.743 319.849 746.041 303.078 743.392 297.04 748.689 290.331 749.351 274.231 752 266.18 752 266.18 747.365 264 734.204 268.78 730.645 264.755 716.243 270.876Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path5" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(706.183 310)"
            id="text52">秋田県</text>
        </g>
        <g
          id="g104">
          <path
            d="M736.732 343.38 739.079 350.084 735.726 351.76 738.073 363.827 733.713 368.52 732.372 379.581 726 384.274 730.695 387.29 739.079 388.966 744.781 395 751.823 388.631 752.494 374.888 760.878 365.168 765.238 366.173 773.957 372.207C773.846 365.615 773.734 359.022 773.622 352.43L781 338.017 772.951 335 769.598 346.397 761.213 347.737 758.531 341.704 746.457 338.017 736.732 343.38Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path8" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(743.483 369)"
            id="text54">宮城県</text>
        </g>
        <g
          id="g105">
          <path
            d="M711.333 332.335 709.667 340.376 696 357.799 705 362.155 704.667 367.515 712.333 371.201 704.667 375.557 701.333 384.938 704 394.32 712.333 394.655 714.333 396.665 725 397C725.111 392.756 725.222 388.512 725.333 384.268L732 380.582 733.667 370.531 738.333 363.83 736 353.443 739 350.763 736.667 343.392 724.333 337.696 719.667 332 711.333 332.335Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path7" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(700.067 356)"
            id="text55">山形県</text>
        </g>
        <g
          id="g106">
          <path
            d="M703.756 393.616 698.397 399.913 699.402 405.878 686.34 408.529C686.451 412.395 686.563 416.262 686.675 420.128L685 433.384 692.034 435.372 711.124 424.105 720.837 425.43 726.196 434.709 733.23 442 738.254 434.709 747.297 438.023 753.995 430.07 755 394.61 751.316 388.314 744.617 394.279 739.258 388.645 731.22 386.988 724.856 385 724.856 395.605 713.804 395.605 711.794 392.622 703.756 393.616Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path10" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(711.9 416)"
            id="text56">福島県</text>
        </g>
        <g
          id="g107">
          <path
            d="M660.667 365.606 663.333 373.543 660.333 377.512 664.333 380.819 665 385.118 657.667 395.37 647.667 392.063 653.667 385.78 649 386.11 649.333 378.173ZM695.667 358 705 361.638 705 367.26 713 371.228 704.667 375.528 701.667 384.787 704.333 393.386 699 400.661 700 406.945 687.333 408.929 686.667 421.496 685.667 428.772 680 430.094 678.333 436.709 666.333 442 667 438.693 661 429.102 653.333 438.693 644 439.024 640.333 434.394 632.333 441.008 624 430.425 649 420.835 664.333 407.606 671 391.732 693.667 376.85Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path9" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(652.65 407)"
            id="text58">新潟県</text>
        </g>
        <g
          id="g109">
          <path
            d="M704 469.047 707.75 474.342 712.25 475.098 723 485.436 736.25 481.906 752 493 751.5 487.705 736.5 470.308 739.75 466.273 740.25 454.927 748 437.53 737.75 434.504 734.25 441.06 726.25 434 723.75 446.607 722.75 457.701 711.5 464.761 704 469.047Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path14" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(725.4 465)"
            id="text59">茨城県</text>
        </g>
        <g
          id="g108">
          <path
            d="M691.014 436.181 692.272 440.407 689 447.864 694.789 452.09 692.02 461.04 700.83 464.023 703.599 468 710.143 465.514 722.224 457.808 723.735 446.124 726 433.446 721.469 425.74 710.898 424 691.014 436.181Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path13" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(693.183 447)"
            id="text60">栃木県</text>
        </g>
        <g
          id="g110">
          <path
            d="M706.336 474 712.046 485.667 711.374 494 716.076 494.667 717.42 499.333 710.031 508 710.702 517.667 706 526.667 714.061 531 717.084 528.333 719.435 521 730.855 518.667 733.542 503.667 750 492 736.229 482 722.122 485.333 712.382 475 706.336 474Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path16" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(718.25 506)"
            id="text63">千葉県</text>
        </g>
        <g
          id="g115">
          <path
            d="M632.333 441.095 632.333 449.83 625 457.893 626 470.66 622.667 472.676 626.333 478.051 616 485.443 623.667 492.834 623.333 498.881 628 499.889 623.667 511.648 635 514 646.667 506.609 645.667 496.194 649.333 485.107 656.667 479.395 667 483.091 663.333 470.324 666 460.245 657.333 458.901 656.667 447.478 666.667 442.439 667 438.743 661.333 429 653.667 437.735 644.333 439.079 640.667 434.04 632.333 441.095Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path11" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(626.692 477)"
            id="text66">長野県</text>
        </g>
        <g
          id="g114">
          <path
            d="M685.5 429 679.5 429.991 678 436.925 656 447.575 657 458.72 665.75 460.453 662.75 470.36 667 482 674.25 472.589 679.25 471.598 684.25 465.159 704 469.121 701 464.168 692.25 460.949 695.75 452.528 689.75 447.575 692.75 440.888 691.25 435.192 685.5 433.953 685.5 429Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path12" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(659.667 459)"
            id="text61">群馬県</text>
        </g>
        <g
          id="g113">
          <path
            d="M667 481.8 675.869 485.354 680.467 482.446 695.577 486 712 485.031 703.788 469.2 684.737 465 679.482 470.815 673.898 472.108 667 481.8Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path15" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(674 479)"
            id="text62">埼玉県</text>
        </g>
        <g
          id="g117">
          <path
            d="M646.75 492 645.25 495.483 646.25 505.933 635 513.646 627 527.828 622 531.062 620 539.273 644 540.019 650.5 543.502 651 535.292 660.75 527.33 663.25 520.115 670 517.129 672.75 521.608 669 526.086C669.083 530.648 669.167 535.209 669.25 539.77L674.75 544 684.5 532.057 685 521.856 684.25 517.129 677.5 512.651 675.75 503.445 668.25 505.187 664 502.45 660.75 502.947C660.833 505.684 660.917 508.421 661 511.158L657.5 515.885 655.75 510.412 651.5 506.679 651 496.976 646.75 492Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path24" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(634.987 529)"
            id="text68">静岡県</text>
        </g>
        <g
          id="g116">
          <path
            d="M655.917 480 648.651 484.624 647 491.89 650.963 497.505 650.963 507.083 655.257 511.046 657.239 516 660.872 512.037 660.541 503.78 663.514 502.789 667.807 505.431 675.734 503.78 683 493.211 676.064 485.284 666.486 482.972 655.917 480Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path18" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(644.721 498)"
            id="text67">山梨県</text>
        </g>
        <g
          id="g111">
          <path
            d="M676 503.4 677.667 512.5 684.333 517.7 692.333 508.275 697 510.875 700 509.9 701 516.4 705 519 707.667 516.075C707.556 511.85 707.444 507.625 707.333 503.4L713 499.175 711.667 493.325 704.667 497.225 701 493 696 498.2 683.333 493.325 676 503.4Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path19" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(673.042 512)"
            id="text65">神奈川県</text>
        </g>
        <g
          id="g121">
          <path
            d="M593.766 507.291 591 516.911 594.771 523.747 598.794 523.494 597.789 535.899 601.309 540.203 603.571 533.367 613.629 534.633 609.857 538.937 604.577 540.456 605.08 544 619.411 539.696 621.674 531.089 626.954 528.051 635 513.367 623.183 510.835 611.869 511.089 603.571 504 593.766 507.291Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path25" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(594.1 525)"
            id="text69">愛知県</text>
        </g>
        <g
          id="g112">
          <path
            d="M676 485.415 682.729 492.887 695.85 499 701.234 492.887 704.262 497.981 711.664 492.887 712 485.075 695.178 485.755 681.383 481 676 485.415Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path17" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(681.583 493)"
            id="text64">東京都</text>
        </g>
        <g
          id="g122">
          <path
            d="M573.888 465 566.605 473.853 561.33 474.865 560.828 480.429 569.367 484.729 561.833 494.088 550.781 497.882 547.265 495.1 544 498.388 546.009 503.447 559.07 508 572.381 496.871 573.386 491.559 578.158 493.329 579.916 487.765 593.228 487.765 598 483.212 593.228 474.359 588.958 470.565 580.419 470.818 573.888 465Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path22" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(550.633 484)"
            id="text73">福井県</text>
        </g>
        <g
          id="g120">
          <path
            d="M597.095 463.439 593.075 474.35 597.849 482.285 593.327 486.996 579.256 487.492 578 493.443 578.502 497.163 583.528 505.841 582.02 509.313 587.548 516.752 591.568 517 594.834 507.081 604.131 504.602 612.422 511.049 623.98 510.801 628 499.146 623.729 498.402 623.729 492.203 616.693 485.012 626.492 477.821 623.477 472.366 625.99 470.382 625.236 458.232 615.94 456 608.402 456.248 604.633 462.447 597.095 463.439Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path23" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(587.6 495)"
            id="text70">岐阜県</text>
        </g>
        <g
          id="g118">
          <path
            d="M623.616 431 623.616 431C618.371 434.359 620.535 433.071 617.205 435L617.205 435 614.74 442.25 606.849 439.5 604.877 434.25 600.438 433.75 596 444 596.986 464 604.877 463.25 608.082 456.75 615.233 456.75 624.356 458.75 631.507 450.5 632 441 623.616 431Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path20" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(598.4 449)"
            id="text71">富山県</text>
        </g>
        <g
          id="g119">
          <path
            d="M600.462 434.357 605.161 434.106 606.645 426.58 602.194 424.322 615.054 417.548 615.301 413.534 620 409.269 616.538 404 603.183 410.021 594.28 412.781 590.57 422.816 594.28 433.353 591.312 444.643 574 465.466 581.419 471.488 588.344 471.488 593.043 475 597 463.208 596.258 443.389 600.462 434.357Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path21" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(577.183 429)"
            id="text72">石川県</text>
        </g>
        <g
          id="g130">
          <path
            d="M418.5 547.114 414.5 553.443 409.5 553.949 405.75 546.101 406.25 538 402.5 539.266 393 548.633 379.5 547.873 374 554.456 377.25 571.165 383.5 568.127 389.25 574.456 407 568.127 422.25 578 428 568.633 426 560.532 418.5 547.114Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path40" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(384.7 565)"
            id="text75">山口県</text>
        </g>
        <g
          id="g129">
          <path
            d="M456.963 520.76 449.814 519 443.158 525.789 443.898 530.064 424.916 533.585 423.437 540.123 419 546.409 425.656 562 436.009 552.947 438.474 560.491 445.623 559.988 457.456 551.69 469.781 554.456 472 551.942 467.563 538.866 468.795 531.825 466.33 519.754 456.963 520.76Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path35" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(430.65 544)"
            id="text76">広島県</text>
        </g>
        <g
          id="g127">
          <path
            d="M466 520.5 468.767 532.25 468.012 538.75 472.288 552 482.098 546 488.386 550 495.933 544.5 505.239 535.75 502.472 530 507 512.5 497.442 514.25 491.153 506 487.129 510.25 477.571 509.5 466 520.5Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path34" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(470.125 533)"
            id="text77">岡山県</text>
        </g>
        <g
          id="g126">
          <path
            d="M507.459 512.178 497.115 514.196 491.564 506.121 486.518 510.664 477.436 509.654 465.83 520 457 519.495 462.046 511.673 466.587 510.411C466.503 507.383 466.419 504.355 466.335 501.327L475.417 499.813 477.436 497.29 496.105 498.299 505.945 493 512 506.879 507.459 512.178Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path33" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(470.875 505)"
            id="text79">鳥取県</text>
        </g>
        <g
          id="g128">
          <path
            d="M441.25 501.535 441.75 507.058 428.5 519.358 418.5 527.893 407 537.181 406 546.469 409.5 554 415 553.247 419 545.967 423.75 539.942 424.75 532.914 443.75 529.65 443.25 526.889 450 518.856 457 520.111 462.5 512.078 467.25 510.07 466.75 500.531 470 496.765 465.75 493 441.25 501.535Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path41" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(417.85 519)"
            id="text80">島根県</text>
        </g>
        <g
          id="g145">
          <path
            d="M885.898 650 879.551 660 872.472 657 872.717 659.75 874.669 664.5 865.882 668.25 868.079 675 861 681.5 864.173 688 872.717 683.75 870.276 680.25 876.134 672.25 872.228 668C874.747 668.774 873.82 668.75 874.913 668.75L885.165 662 892 653.25 885.898 650Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path49" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(857.384 674)"
            id="text81">沖縄県</text>
        </g>
        <g
          id="g144">
          <path
            d="M357.5 651 349.5 653.971 348.25 670.067 355 676.257 348 684.181 352.75 692.105 366 696.562 367.25 689.629 363.5 680.714 368.75 672.543 373.25 675.514 372 685.171 374.75 690.867 366.25 703 388 690.124 384.5 684.676 387.5 673.286 383 672.295 379.25 663.628 368.25 651.99 357.5 651Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path47" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(338.917 676)"
            id="text82">鹿児島県</text>
        </g>
        <g
          id="g139">
          <path
            d="M389.894 618 380.196 635.124 384.175 649.022 375.222 652.993 370 652.496 379.45 663.664 383.926 672.847 387.656 673.095 385.667 681.781 391.386 686 395.862 685.504 401.085 673.095 398.349 664.161 402.328 657.212 401.582 647.781 409.54 636.861 408.794 632.891 417 625.445 410.534 620.234 395.614 622.715 389.894 618Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path48" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(385.9 650)"
            id="text83">宮崎県</text>
        </g>
        <g
          id="g143">
          <path
            d="M329.75 610.146 337.5 613.872 337 621.822 342.75 627.783 333.5 633 335 620.331 328 616.357ZM333 594 339.5 604.185 344.75 606.172 344.25 610.892 353.5 615.363 360 623.561 357.75 630.765 349 631.758 345.5 618.096 341.5 617.102 339.5 612.134 325.75 606.669 325 598.72 327 594.994Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path45" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(312.072 618)"
            id="text84">長崎県</text>
        </g>
        <g
          id="g141">
          <path
            d="M362.453 573.708 355.876 582.359 345 586.809 355.371 595.213 361.441 594.225 361.947 598.674 354.106 604.359 358.406 614 369.535 606.09 375.1 608.067 374.594 594.719 378.388 590.764 387.241 589.775 388 583.595 381.423 580.135 381.423 573.213 373.835 570 362.453 573.708Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path42" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(350.375 586)"
            id="text86">福岡県</text>
        </g>
        <g
          id="g142">
          <path
            d="M345.398 586 337.965 588.017 334 592.807 340.442 605.16 344.655 605.916 343.664 611.21 353.575 616 353.327 609.698 355.558 607.933 354.566 603.395 362 597.849 361.752 594.067 355.805 594.319 345.398 586Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path44" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(332.15 602)"
            id="text85">佐賀県</text>
        </g>
        <g
          id="g138">
          <path
            d="M375.005 608.402 378.775 612.927 381.037 604.883 390.084 612.425 389.832 617.704 395.864 622.732 410.188 620.218 416.974 626 422 616.447 415.969 613.43 419.738 608.905 414.461 601.363 405.414 599.603 409.937 592.061 408.681 585.274 403.403 581 396.115 586.279 387.822 583.263 386.565 589.045 378.272 590.553 374 594.575 375.005 608.402Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path43" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(382.914 606)"
            id="text87">大分県</text>
        </g>
        <g
          id="g124">
          <path
            d="M566.224 531.462 569.454 538.791 568.212 542.077 575.418 546.626 571.194 549.912C571.277 555.22 571.359 560.528 571.442 565.835L562 573.165 564.733 581 577.903 571.901 577.903 563.308 580.636 562.802 591.57 555.725 602.006 559.516 603 548.396 594.055 541.571 588.339 535.506 593.061 529.692 594.303 522.868 591.57 516.549 587.594 516.549 583.121 512 583.618 522.363 577.903 527.923 573.43 527.923 566.224 531.462Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path28" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(577.2 550)"
            id="text94">三重県</text>
        </g>
        <g
          id="g140">
          <path
            d="M344.971 633.206 351.19 637.66 358.156 636.423 358.902 641.619 353.927 642.856 351.937 639.144 344.722 650.031 339 641.124ZM380.546 605 390 611.68 390 616.876 380.049 634.938 384.029 649.289 374.576 653 367.361 651.763 356.415 650.526 364.624 637.907 357.659 635.186 364.127 627.021 361.39 620.835 358.405 614.402 369.351 606.237 375.571 608.216 378.805 612.423Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path46" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(348.375 634)"
            id="text88">熊本県</text>
        </g>
        <g
          id="g131">
          <path
            d="M477.466 554.162 475 559.041 479.438 567 491.027 563.662 497.192 563.149 500.644 560.581 503.356 560.068 509.274 559.811 511 558.013 498.425 548 490.288 552.878 484.123 552.878 477.466 554.162Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path36" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(471.979 558)"
            id="text89">香川県</text>
        </g>
        <g
          id="g125">
          <path
            d="M529.925 542.284 532.644 545.568 527.454 551.126 530.667 556.432 522.264 563 517.075 557.442 519.546 548.6ZM511.885 491 524.488 492.011 525.971 498.832 531.161 499.842 530.667 503.126 526.218 504.642 525.971 508.684 533.879 515 543.023 516.263 543.27 520.053 540.799 521.316 545 527.379 544.259 538.495 539.069 536.726 529.678 540.516 520.287 534.453 504.966 535.716 502 529.653 507.19 512.221 512.379 507.421 506.448 493.274Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path32" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(498.342 522)"
            id="text78">兵庫県</text>
        </g>
        <g
          id="g132">
          <path
            d="M480 567.182 480 573.387 488.947 577.606 492.923 576.613 500.627 590.015 506.84 592 515.041 581.328 522 576.365 518.272 567.679 514.793 565.197 518.521 561.474 510.817 558 501.373 559.985 496.899 563.212 489.692 563.46 480 567.182Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path37" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(494 576)"
            id="text90">徳島県</text>
        </g>
        <g
          id="g137">
          <path
            d="M477.537 564.28 472.996 568.08 464.167 568.587 461.392 571.373 456.094 562 450.544 563.013 444.489 568.587 441.714 575.68 442.975 583.787 431.623 587.84 418 597.213 420.018 600.507 430.362 596.2 431.371 600.507 433.893 600.507 436.416 605.067 432.128 606.587 435.155 611.907 435.155 617.48 440.957 619 443.985 614.693 441.966 606.84 451.553 597.72 447.769 592.4 454.832 590.627 461.644 577.96 480.06 572.893C483.13 572.007 481.742 567.742 481.322 566.307 480.901 564.871 478.715 565.04 477.537 564.28Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path38" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(425 581)"
            id="text91">愛媛県</text>
        </g>
        <g
          id="g135">
          <path
            d="M551.965 554.245 542.599 554 533.479 554.736 532 573.386 542.106 580.012C542.188 582.875 542.27 585.738 542.352 588.601L559.606 594 567 587.129 563.549 579.031 561.331 572.65 551.718 573.632 549.5 559.644 551.965 554.245Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path30" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(526 583)"
            id="text93">和歌山県</text>
        </g>
        <g
          id="g134">
          <path
            d="M555.815 534 552.786 543.75 552.786 553.25 549 560 551.272 574 561.621 572.75 571.466 565.25 570.456 549.75 575 546.5 567.68 541.75 568.185 538.75 565.66 535.25 555.815 534Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path29" />
          <text
            font-weight="700"
            font-size="10.6667px"
            id="text98"
            x="544.12695"
            y="565.13013">奈良県</text>
        </g>
        <g
          id="g136">
          <path
            d="M440.51 618.643 438 625.704 453.308 626.461 456.821 631 459.08 624.696 456.57 614.357 462.844 611.583 469.62 598.217 479.658 590.148 488.943 592.165 491.453 597.965 498.73 605.278 503.247 598.217 504 590.4 499.985 589.139 492.707 576.278 488.692 577.539 480.16 573 461.087 577.791 454.312 590.652 447.536 591.661 451.551 598.217 441.262 607.296 443.772 614.104 440.51 618.643Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path39" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(453.1 600)"
            id="text92">高知県</text>
        </g>
        <g
          id="g146">
          <path
            d="M544.75 502.487 543.25 498.933 538.75 495.124 541.5 488.777 536.5 487 524 492.078 525.25 499.44 530.75 500.456 530.25 504.264 526 505.026 525.5 509.342 533.75 515.943 542.75 516.959 543.25 520.767 549 526.606 552.5 524.829 556.25 533.969 567 536 564.25 528.13 558.25 521.275 560.25 508.834 544.75 502.487Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path26" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(523.85 509)"
            id="text96">京都府</text>
        </g>
        <g
          id="g133">
          <path
            d="M543.153 521 540.435 522.5 545.129 528.25 544.635 543.5 535 553.75 543.647 554 552.788 553.75 552.788 543.75 556 534 553.035 524.5 549.824 525.75 543.153 521Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path31" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(525.5 543)"
            id="text74">大阪府</text>
        </g>
        <g
          id="g123">
          <path
            d="M559.25 507.4 560 510.63 558 521.067 564.5 527.527 565.75 532 572 528.521 577.25 528.521 583 523.303 582 509.139 582.75 506.158 578.5 498.206 577.25 492.988 572 491 571.75 496.467 559.25 507.4Z"
            stroke="#FFFFFF"
            stroke-width="2"
            stroke-miterlimit="8"
            fill="#10B981"
            fill-rule="evenodd"
            id="path27" />
          <text
            font-weight="700"
            font-size="10.6667"
            transform="translate(554.35 518)"
            id="text97">滋賀県</text>
        </g>
      </g>
    </svg>
  );

  return (
    <>
      <MapApp allDistricts={allDistricts} gameTitle={gameTitle} gameid={gameid} isWide={isWide}>
        {svgContent}
      </MapApp>
    </>
  );
};

export default Japan;